
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеОбъекта = РеквизитФормыВЗначение("Запись");
	
	ДанныеПолученныхПакетноСообщений = ДанныеОбъекта.ДанныеПолученныхПакетноСообщений.Получить();
	
	Если НЕ ДанныеПолученныхПакетноСообщений = Неопределено Тогда
		РезультатПолученияСообщений.Загрузить(ДанныеПолученныхПакетноСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыНаСервере(ТекущаяСтраница)
	
	ДанныеОбъекта = РеквизитФормыВЗначение("Запись");
	
	Если ТекущаяСтраница = "Запрос" Тогда
		Если НЕ ЗапросЗагружен Тогда
			Запрос			= ДанныеОбъекта.ДанныеЗапроса.Получить();
			ЗапросЗагружен	= Истина;
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = "Ответ" Тогда
		Если НЕ ОтветЗагружен Тогда
			ОтветСервера	= ДанныеОбъекта.ОтветСервера.Получить();
			ОтветЗагружен	= Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ГруппаСтраницыПриСменеСтраницыНаСервере(ТекущаяСтраница.Имя);
	
КонецПроцедуры

#КонецОбласти
