Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
КонецПроцедуры

Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
КонецПроцедуры

Процедура НастроитьНаборыСвойств(Наборы) Экспорт
	
КонецПроцедуры

Процедура ОпределитьПодсистемаПрименяется(ПодсистемаПрименяется) Экспорт
	
КонецПроцедуры

Процедура СоздатьКомпонентыАмортизации(МенеджерВременныхТаблиц, Период, Организация, ЗадерживатьАмортизацию) Экспорт
	
КонецПроцедуры

Процедура НачатьРазбиение(ДанныеКомпонентов, МенеджерВременныхТаблиц, ЗадерживатьАмортизацию, КонецЗадержкиАмортизации) Экспорт
	
КонецПроцедуры

Процедура РазбитьРасчет(ЗаписьОценка, ДанныеВсехКомпонентов) Экспорт
	
КонецПроцедуры

Процедура ДобавитьТипыКомпонентовАмортизации(Типы) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьИтогРесурса(Расчет) Экспорт
	
КонецПроцедуры

Процедура ОпределитьИтогРесурса(Итог, Запись) Экспорт
	
КонецПроцедуры

Процедура ИнициализироватьКонтейнерИтогов(Контейнер) Экспорт
	
КонецПроцедуры

Процедура РассчитатьИтоги(Контейнер, МенеджерВременныхТаблиц, РасчетАмортизации) Экспорт
	
КонецПроцедуры

Процедура ЗаписатьИтоги(Движения, ТаблицаРеквизиты, Контейнер) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьАктуальныеЗначения(АктуальныеЗначения, Отбор, Период, Организация) Экспорт
	
КонецПроцедуры

Процедура ДобавитьОбработчикОбновленияНовыйРегистрСведенийРасчетСтоимостиКомпонентовАмортизации(Обработчики, НомерВерсии) Экспорт
	
КонецПроцедуры

Процедура НачатьПроверкуБлокировкиНеобработанныхДанныхРасчетАмортизации(РегламентнаяОперация, ПроверяемыйОбъект) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияКомпонентыАмортизацииОС(Движения, ТаблицаРеквизиты, ЭлементыАмортизации) Экспорт
	
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Процедура ВывестиТабличныйДокументВКоллекцию(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати) Экспорт
	
КонецПроцедуры

Процедура ДобавитьОграниченияОпцииКомпонентыАмортизации(УсловияДоступности) Экспорт
	
КонецПроцедуры

