#Область СлужебныйПрограммныйИнтерфейс

Процедура НаписатьОбращениеВТехподдержку1СОшибкаАУСН(АдресДанных, Ключ) Экспорт
	
	ПараметрыОбращения =
		РаботаСОповещениямиОСостоянииОбменаССервисамиВызовСервера.ПараметрыОбращенияВТехподдержкуОшибкаАУСН(
			АдресДанных);
	
	Если ПараметрыОбращения.ЭтоРежимСервиса Тогда
		ПараметрыФормы = Новый Структура("СоздаватьСообщение", Истина);
		ФормаОбращения = ПолучитьФорму(
			"Обработка.ИнформационныйЦентр.Форма.ОтправкаСообщенияВСлужбуПоддержки",
			ПараметрыФормы,
			,
			Ключ);
		ФормаОбращения.Тема = ПараметрыОбращения.Тема;
		ФормаОбращения.Содержание.Удалить();
		ФормаОбращения.Содержание.Добавить(
			ПараметрыОбращения.ПорядокВоспроизведения, Тип("ТекстФорматированногоДокумента"));
	Иначе
		ПараметрыФормы = Новый Структура("ТипСообщения", "Ошибка");
		
		ФормаОбращения = ПолучитьФорму(
			"Обработка.ОбращениеВТехническуюПоддержку.Форма.ОбращениеВПоддержку",
			ПараметрыФормы,
			,
			Ключ);
		
		ЗаполнитьЗначенияСвойств(ФормаОбращения, ПараметрыОбращения);
	КонецЕсли;
	
	ФормаОбращения.Открыть();
	
КонецПроцедуры

Процедура ОткрытьИнформациюОбОшибкеАУСН(АдресДанных, Ключ) Экспорт
	
	ПараметрыФормы = РаботаСОповещениямиОСостоянииОбменаССервисамиВызовСервера.ПараметрыФормыИнформацииОбОшибкеАУСН(
		АдресДанных);
	ОткрытьФорму("ОбщаяФорма.ИнформацияОбОшибкеОбменаАУСН", ПараметрыФормы, , Ключ);
	
КонецПроцедуры

Процедура ОткрытьОшибкиОтправкиАУСН(АдресДанных, Ключ) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеОбмена", АдресДанных);
	
	ОткрытьФорму("ОбщаяФорма.ОшибкиОтправкиАУСН", ПараметрыФормы, , Ключ);
	
КонецПроцедуры

#КонецОбласти