Процедура СформироватьДвиженияРегламентнойОперации(Движения, Период, Организация, Ссылка) Экспорт
	
КонецПроцедуры

Процедура РассчитатьВыбытиеОбесцененияЗапасов(Выбытие, Организация, НачалоПериода, КонецПериода, Счет) Экспорт
	
КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
КонецПроцедуры

Процедура НастроитьНаборыСвойств(Наборы) Экспорт
	
КонецПроцедуры

Процедура ВключитьНаборыСвойств(Значение) Экспорт
	
КонецПроцедуры

Процедура НастроитьКомандыПечати(СписокОбъектов) Экспорт
	
КонецПроцедуры

Процедура ЗапросДанныхРетроспективногоОбесценения(Запрос) Экспорт
	
КонецПроцедуры

Процедура УчестьРетроспективноеОбесценение(ВыборкаПоОС, АмортизацияФСБУ6, УвеличениеАмортизацииБУ, УменьшениеАмортизацииБУ) Экспорт
	
КонецПроцедуры

