#Область ПрограммныйИнтерфейс

// Возвращает признак того, что в базе есть хоть одна организация, подключенная к сервису Автоматизированная УСН
//
// Возвращаемое значение:
//  Булево
//
Функция СервисПодключен() Экспорт
	
	Возврат РегистрыСведений.СостоянияИнтеграцииАУСН.СервисПодключен();
	
КонецФункции

// Возвращает идентификатор, присвоенный банку в сервисе АУСН
// 
// Параметры:
//  Банк - СправочникСсылка.КлассификаторБанков
// 
// Возвращаемое значение:
//   Строка
//
Функция ИдентификаторБанкаПоКлассификатору(Банк) Экспорт
	
	Возврат ИнтеграцияАУСНПовтИсп.ИдентификаторБанкаПоКлассификатору(Банк);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция КодСтраныГражданстваНайденВКлассификаторе(КодГражданства) Экспорт
	
	Возврат Справочники.СтраныМира.ДанныеСтраныМира(КодГражданства) <> Неопределено;
	
КонецФункции

#КонецОбласти