Процедура ДополнитьРазрезыРаспределения(РазрезыРаспределения, МенеджерВременныхТаблиц, ТолькоСубконтоПользователя = Истина) Экспорт
	
КонецПроцедуры

Процедура ДобавитьСчетБракВПроизводстве(СчетаРасходов) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьАналитикуРаспределенияНаФинансовыйРезультат(АналитикаРаспределения, СчетРезультата, РазрезыРаспределения) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьАналитикуРаспределенияСчета(АналитикаРаспределения, СчетРезультата, РазрезыРаспределения, 
                                               НедоступныеРазрезыРаспределения) Экспорт
	
КонецПроцедуры

Процедура УстановитьГибкаяНастройкаПравилРаспределения(ГибкаяНастройкаПравилРаспределения) Экспорт
	
КонецПроцедуры

Процедура ДобавитьПравилоРаспределитьПоКоэффициентамСчетовУчета(Процессор, ПараметрыРаспределения, Модификатор, ОтборРасходов) Экспорт
	
КонецПроцедуры

