Процедура ЗаполнитьСписокВыбораСпособОценкиАрендыБУПоступление(Форма) Экспорт
	
КонецПроцедуры

Процедура УстановитьСпособОценкиАрендыБУПоступление(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормойПоступление(Форма) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораСпособОценкиАрендыБУИзменение(Форма) Экспорт
	
КонецПроцедуры

Процедура УстановитьСпособОценкиАрендыБУИзменение(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормойИзменение(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормойВводОстатков(Форма) Экспорт
	
КонецПроцедуры

Процедура СформироватьНадписьГрафикПроцентныхРасходов(Форма, СпособОценки) Экспорт
	
КонецПроцедуры

Процедура СформироватьНадписьГрафикПлатежей(Форма, СпособОценки) Экспорт
	
КонецПроцедуры

