Процедура ОпределитьФункциональностьДоступна(Доступна) Экспорт
	
КонецПроцедуры

Процедура ПересчитатьАмортизацию(Результат, Год, Организация) Экспорт
	
КонецПроцедуры

Процедура ИнициализироватьЗаписиАмортизации(ЗаписиАмортизации) Экспорт
	
КонецПроцедуры

Процедура ДобавитьЗаписиАмортизации(ЗаписиАмортизации, ПересчетЗаГод, СведенияОС, СчетЗатрат, ДанныеПостоянныхРазниц, Регистратор) Экспорт
	
КонецПроцедуры

Процедура УстановитьАналитикуЗатрат(ЗаписьАналитикиЗатрат, ЗаписьАмортизации, Кеш = Неопределено) Экспорт
	
КонецПроцедуры

