//@strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ДополнительныеПоля

// Возвращает поддерживаемые типы разделов дополнительных полей документов.
//
// Возвращаемое значение:
//  Структура:
//   * Шапка   - Строка
//   * Таблица - Строка
//
Функция ТипыРазделовДополнительныхПолей() Экспорт

	ТипыРазделов = Новый Структура;
	ТипыРазделов.Вставить("Шапка", "Шапка");
	ТипыРазделов.Вставить("Таблица", "Таблица");
	
	Возврат ТипыРазделов;
	
КонецФункции

#КонецОбласти

#Область СозданиеДокументаПоФайлу

// Возвращает пустые параметры создания документа по файлу.
// 
// Возвращаемое значение:
//  Структура - Новые параметры создания произвольного документа:
//  * Организация - Неопределено,ОпределяемыйТип.Организация - организация, от имени которой нужно отправить документ.
//  * Контрагент - Неопределено,ОпределяемыйТип.КонтрагентБЭД - контрагент, которому нужно отправить документ.
//  * Договор - Неопределено,ОпределяемыйТип.ДоговорСКонтрагентомЭДО - договор, по которому отправляется документ.
//  * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид электронного документа. Если не указан, то определяется автоматически.
//  * НомерДокумента - Строка - номер электронного документа.
//  * ДатаДокумента - Дата - дата электронного документа
//  * СуммаДокумента - Число - сумма по документу.
//  * ОбъектыУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - учетные объекты, которые нужно проставить в качестве основания.
//  * Подписанты - Массив из ОпределяемыйТип.Пользователь - подписанты электронного документа. Если не указаны, то заполняются из настроек. Если указаны, то устанавливается маршрут подписания См. МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании.
//
Функция НовыеПараметрыСозданияДокументаПоФайлу() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("Организация", Неопределено);
	Параметры.Вставить("Контрагент", Неопределено);
	Параметры.Вставить("Договор", Неопределено);
	Параметры.Вставить("ВидДокумента", ПредопределенноеЗначение("Справочник.ВидыДокументовЭДО.ПустаяСсылка"));
	Параметры.Вставить("НомерДокумента", "");
	Параметры.Вставить("ДатаДокумента", Дата(1,1,1));
	Параметры.Вставить("СуммаДокумента", 0);
	Параметры.Вставить("ОбъектыУчета", Новый Массив);
	Параметры.Вставить("Подписанты", Новый Массив);
	Возврат Параметры;
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

#Область ОбработкаДействийПоЭДО

// Устарела: Следует использовать см. ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие
// 
// Параметры:
//  НаборДействий - См. ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО
//  Действие      - ПеречислениеСсылка.ДействияПоЭДО
//
Процедура ДобавитьДействие(НаборДействий, Действие) Экспорт
	ИнтерфейсДокументовЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Действие);
КонецПроцедуры

// Устарела: Следует использовать см. ИнтерфейсДокументовЭДОКлиентСервер.НовыеДополнительныеПараметрыДействия
// 
// Возвращаемое значение:
//  См. ИнтерфейсДокументовЭДОКлиентСервер.НовыеДополнительныеПараметрыДействия
//
Функция НовыеДополнительныеПараметрыДействия() Экспорт
	Возврат ИнтерфейсДокументовЭДОКлиентСервер.НовыеДополнительныеПараметрыДействия();
КонецФункции

// Устарела: Следует использовать см. ИнтерфейсДокументовЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО
// 
// Возвращаемое значение:
//  См. ИнтерфейсДокументовЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО
Функция НовыйИтогВыполненияДействийПоЭДО() Экспорт
	Возврат ИнтерфейсДокументовЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО();
КонецФункции

// Устарела: Следует использовать см. ИнтерфейсДокументовЭДОКлиентСервер.НовыеОбъектыДействийПоЭДО
// 
// Возвращаемое значение:
//  См. ИнтерфейсДокументовЭДОКлиентСервер.НовыеОбъектыДействийПоЭДО
//
Функция НовыеОбъектыДействийПоЭДО() Экспорт
	Возврат ИнтерфейсДокументовЭДОКлиентСервер.НовыеОбъектыДействийПоЭДО();
КонецФункции

// Устарела: Следует использовать см. ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО
// 
// Возвращаемое значение:
//  См. ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО
//
Функция НовыеПараметрыВыполненияДействийПоЭДО() Экспорт
	Возврат ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
КонецФункции

// Возвращает новые данные подписи с учетом доверенности.
// 
// Возвращаемое значение:
//  Структура:
//   * СвойстваПодписи - Неопределено 
//   				   - См. ЭлектронныеДокументыЭДО.НовыеДанныеПодписи
//   * ЭтоПодписьПоДоверенности - Булево
//   * СвойстваДоверенности - Неопределено,
//   						- см. МашиночитаемыеДоверенности.ОбщиеСвойстваДоверенности
//   * РезультатПроверкиПоМЧД - Неопределено, 
//   						  - см. МашиночитаемыеДоверенности.НовыйРезультатПроверкиПодписи
//   						  
//   * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
Функция НовыеДанныеПодписиСУчетомДоверенности() Экспорт
	
	ДанныеПодписи = Новый Структура;
	ДанныеПодписи.Вставить("СвойстваПодписи", Неопределено);
	ДанныеПодписи.Вставить("ЭтоПодписьПоДоверенности", Ложь);
	ДанныеПодписи.Вставить("СвойстваДоверенности", Неопределено);
	ДанныеПодписи.Вставить("РезультатПроверкиПоМЧД", Неопределено);
	ДанныеПодписи.Вставить("ПодписанныйОбъект", ПредопределенноеЗначение("Справочник.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка"));

	Возврат ДанныеПодписи;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область КонтрактМенеджераДействийЭДО

// Возвращаемое значение:
//  Строка -  Идентификатор обработчика действий по ЭДО
Функция ИдентификаторМенеджераДействийЭДО() Экспорт
	Возврат "ЭлектронныеДокументыЭДО";
КонецФункции

#КонецОбласти

#КонецОбласти
