
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПользователейПараметр = Неопределено;
	Параметры.Свойство("СписокПользователей", СписокПользователейПараметр); 
	Параметры.Свойство("Организация", Организация); 
	
	ДанныеОрганизации = ИнтеграцияЭДО.РегистрационныеДанныеОрганизации(Организация);
	
	НаименованиеОрганизации = ДанныеОрганизации.Наименование;
	ДатаВступленияВСилу = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(СписокПользователейПараметр) Тогда
		СписокПользователей.ЗагрузитьЗначения(СписокПользователейПараметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьЛистОзнакомления(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("НаименованиеОрганизации", НаименованиеОрганизации);
	ПараметрыЗаполнения.Вставить("СписокПользователей", СписокПользователей.ВыгрузитьЗначения());
	ПараметрыЗаполнения.Вставить("Организация", Организация);
	ПараметрыЗаполнения.Вставить("ДатаВступленияВСилу",  Формат(ДатаВступленияВСилу, "ДЛФ=D"));
	
	УведомленияОбИспользованииПЭП = ШаблонУведомленияОбИспользованииПЭП(ПараметрыЗаполнения);
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("УведомленияОбИспользованииПЭП");
	ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "УведомленияОбИспользованииПЭП"); 
	ОписаниеПечатнойФормы.ТабличныйДокумент = УведомленияОбИспользованииПЭП;

	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ШаблонУведомленияОбИспользованииПЭП(ПараметрыЗаполнения)
	
	Возврат НастройкиВнутреннегоЭДОСлужебный.ШаблонУведомленияОбИспользованииПЭП(ПараметрыЗаполнения);
		
КонецФункции

#КонецОбласти
