
#Область ПрограммныйИнтерфейс

// Заполняет параметры сообщения электронной почты, отправляемого без шаблона.
// См. ПереводыСБПc2bКлиентПереопределяемый.ПриЗаполненииПараметровСообщенияБезШаблонаСБП
//
Процедура ПриЗаполненииПараметровСообщенияБезШаблонаСБП(ПараметрыСообщения, ПараметрыОперации) Экспорт
	
	ИнтеграцияССБПБП.ПриЗаполненииПараметровСообщенияБезШаблонаСБП(ПараметрыСообщения, ПараметрыОперации);
	
КонецПроцедуры

Функция ВозвратОплаты(ДокументВозврат, ДокументПродажи, ПараметрыОперации) Экспорт
	
	ДополнительныПараметры = Новый Структура;
	ДополнительныПараметры.Вставить("ДатаВозврата",  ПараметрыОперации.Дата);
	ДополнительныПараметры.Вставить("СуммаВозврата", ПараметрыОперации.Сумма);
	
	Возврат ПереводыСБПc2b.ВозвратОплаты(
		ДокументВозврат,
		ДокументПродажи,
		ПараметрыОперации.НастройкаИнтеграции,
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОперации, "УчастникСБП", Неопределено),
		ДополнительныПараметры);
	
КонецФункции

Функция СтатусВозврата(УникальныйИдентификатор, ДокументВозврата, НастройкиПодключения) Экспорт
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		УникальныйИдентификатор, "ПереводыСБПc2b.СтатусВозврата", ДокументВозврата, НастройкиПодключения, Истина);
	
КонецФункции

Функция ПодтвердитьВозврат(ДокументВозврата, НастройкиПодключения) Экспорт
	
	Возврат ПереводыСБПc2b.ПодтвердитьВозврат(ДокументВозврата, НастройкиПодключения);
	
КонецФункции

Функция СтатусОплаты(УникальныйИдентификатор, ДокументОплаты, НастройкаИнтеграции) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка оплаты ссылки'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "ПереводыСБПc2b.СтатусОплаты", ДокументОплаты, НастройкаИнтеграции);
	
КонецФункции

#КонецОбласти