Процедура УстановитьСубконтоРемонтыОС() Экспорт
	
КонецПроцедуры

Процедура РассчитатьАмортизацию(Результаты, ТаблицаРеквизиты, ТаблицаОС, Отказ, Ошибки = Неопределено) Экспорт
	
КонецПроцедуры

Процедура ОтразитьАмортизациюВУчете(Результаты, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура РассчитатьВыбытие(Результаты, ТаблицаРеквизиты, ТаблицаОС, Отказ) Экспорт
	
КонецПроцедуры

Процедура ОтразитьВыбытиеВУчете(Результаты, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура ОтразитьПеремещениеВУчете(Результаты, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура ОтразитьОприходованиеМатериалов(ТаблицаМатериалы, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьДокументыРемонтовПриВводеОстатков(ДокументВводаОстатков, Отказ) Экспорт
	
КонецПроцедуры

Процедура СформироватьНачальныеОстатки(ТаблицаЗатратыНаРемонтОС, СодержаниеПроводки, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаСправкаРасчетАмортизации(ТекстЗапроса) Экспорт
	
КонецПроцедуры

Процедура ДополнитьИменамиДокументовРемонтыОС(ИменаДокументов) Экспорт
	
КонецПроцедуры

Процедура ДобавитьСчетВложенияВРемонтыОсновныхСредств(СчетаРасходов) Экспорт
	
КонецПроцедуры

Процедура ДобавитьПравилоВыделитьНалоговыйУчетКапитализируемыеРемонтыОС(ПравилаРаспределения, ПравилаПоСчету, Счет, Организация, Период) Экспорт
	
КонецПроцедуры

Процедура ДобавитьПравилаКапитализируемыеРемонтыОС(Процессор) Экспорт
	
КонецПроцедуры

Процедура ДобавитьПравилоЗатратыКапитализируемыеРемонтыНаСтоимостьОС(Процессор) Экспорт
	
КонецПроцедуры

