Процедура ОпределитьПоддержкуДисконтированияОбязательств(УчетПоддерживается) Экспорт
	
КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
КонецПроцедуры

Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
КонецПроцедуры

Процедура НастроитьНаборыСвойств(Наборы) Экспорт
	
КонецПроцедуры

Процедура ДобавитьКомандуПечатиНачислениеПроцентныхРасходов(КомандыПечати) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияПоступлениеПроцентыПоАренде(ТаблицаОС, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДисконтированияОбязательстваПоАренде(ДокументОбъект, Отказ, РежимЗаписи, ИзменениеУсловий = Ложь, ЭтоПереходНаФСБУ25 = Ложь) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияИзменениеУсловийПроцентыПоАренде(ТаблицаОС, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыПроцентовПрекращениеАренды(СтруктураРезультат, ТаблицаПредметыАренды, ТаблицаРеквизиты) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияПроцентыПоРассрочке(ТаблицаТМЦ, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияНачислениеПроцентныхРасходов(Движения, ТаблицаПроценты, ТаблицаРеквизиты) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДисконтированияОбязательстваПоРассрочке(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияГрафикиПроцентныхРасходов(ТаблицаГрафик, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыНачислениеПроцентныхРасходов(СтруктураТаблиц, ТаблицаРеквизиты, Отказ, Ошибки) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьТаблицуДокументаДляЦелейПриобретенияРеализации(ТаблицаТМЦ, Реквизиты) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьГрафикПроцентов(СтруктураРезультат,
								   ТаблицаГрафикПлатежей,
								   ТаблицаПредметыНачисления,
								   ТаблицаРеквизиты,
								   ВидПредмета) Экспорт
	
КонецПроцедуры

Процедура ДополнитьМассивИменамиДокументовПоРассрочке(ИмяМассива) Экспорт
	
КонецПроцедуры

