

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Документ = Параметры.Документ;
	ВидДокументаОбжалованияОтказаОПриемке = Параметры.ВидДокументаОбжалованияОтказаОПриемке;
	РеквизитыДокументаОбжалованияОтказаОПриемке = Параметры.РеквизитыДокументаОбжалованияОтказаОПриемке;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВидДокументаОбжалованияОтказаОПриемке", ВидДокументаОбжалованияОтказаОПриемке);
	СтруктураВозврата.Вставить("РеквизитыДокументаОбжалованияОтказаОПриемке", РеквизитыДокументаОбжалованияОтказаОПриемке);
	
	ЗаписатьДанныеПоДокументуНаСервере();
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеПоДокументуНаСервере()

	НаборДанныеДокумента = РегистрыСведений.ДанныеДокументовЭлектронногоАктированияЕИС.СоздатьНаборЗаписей();
	НаборДанныеДокумента.Отбор.Документ.Установить(Документ);
	
	НаборДанныеДокумента.Прочитать();
	
	Если НаборДанныеДокумента.Количество() = 0 Тогда
		ЗаписьНабора = НаборДанныеДокумента.Добавить();
	Иначе
		ЗаписьНабора = НаборДанныеДокумента[0];	
	КонецЕсли;
	
	ЗаписьНабора.Документ = Документ;
	ЗаписьНабора.Организация = Организация;
	ЗаписьНабора.ВидДокументаОбжалованияОтказаОПриемке = ВидДокументаОбжалованияОтказаОПриемке;
	ЗаписьНабора.РеквизитыДокументаОбжалованияОтказаОПриемке = РеквизитыДокументаОбжалованияОтказаОПриемке;
	
	НаборДанныеДокумента.Записать(Истина);
	
КонецПроцедуры

