Процедура ОбработкаВыбора(Форма, ВыбранноеЗначение, ИсточникВыбора, СпособОценки) Экспорт
	
КонецПроцедуры

Процедура ПолучитьПараметрыФормыГрафикПлатежейДляАренды(Форма, ПараметрыФормы) Экспорт
	
КонецПроцедуры

Процедура ПолучитьПараметрыФормыГрафикПлатежейДляРассрочки(Форма, ПараметрыФормы) Экспорт
	
КонецПроцедуры

Процедура ПолучитьПараметрыФормыГрафикПроцентныхРасходов(Форма, ПараметрыФормы) Экспорт
	
КонецПроцедуры

Процедура НадписьГрафикПлатежейНажатие(Форма, СтандартнаяОбработка, ПараметрыФормы) Экспорт
	
КонецПроцедуры

Процедура НадписьГрафикПроцентныхРасходовНажатие(Форма, СтандартнаяОбработка, ПараметрыФормы) Экспорт
	
КонецПроцедуры

